LEXICON: dict[str, str] = {
    "/start":       "<b>🎬 ДОБРО ПОЖАЛОВАТЬ В CINEMA BOT! ✨</b>👋\n\nЯ — ваш персональный гид в мире кино!\n"
                    "📌 <u>Что я умею:</u>\n• 🎭 Находить фильмы по критериям\n• ⭐ Сохранять понравившиеся фильмы"
                    " в избранное\n• 🎬 Показывать трейлеры и описания\n• 📊 Вести вашу личную статистику\n"
                    "🎯 <u>Как пользоваться:</u>\n1. Используйте кнопки меню для навигации\n2. Ищите фильмы через поиск\n"
                    "3. Сохраняйте понравившиеся фильмы\n4. Смотрите трейлеры и читайте описания\n\n"
                    "<b>✨ Начните прямо сейчас!</b>",
    "/go":          "Вы в главном меню\nЧтобы продолжить, выберите действие с помощью "
                    "кнопок главного меню 👇",
    "help":         "Используйте бота, чтобы найти фильм идеально подходящий под ваш запрос",
    "please":       "Я не знаю такую команду 🤔\n\nФункционал бота был обновлён, некоторые команды больше "
                    "не используются.\nПожалуйста, нажмите /start, чтобы узнать, что делает этот бот.",
    "no_years":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста, "
                    "выберите год выпуска фильма с помощью кнопок ниже 👇",
    "no_genre":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите жанр фильма с помощью кнопок ниже 👇",
    "no_rating":    "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите рейтинг фильма с помощью кнопок ниже 👇",
    "no_time":      "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите время просмотра фильма с помощью кнопок ниже 👇",
    "no_results":   "😔 По вашим критериям не найдено фильмов\n"
                    "Попробуйте:\n"
                    "• Расширить критерии поиска\n"
                    "• Использовать кнопку 'Пропуск' для некоторых параметров\n"
                    "• Начать новый поиск",
    "no_show":      "Я вас не понял\nПожалуйста выберите действие с помощью кнопок ниже 👇",
    "movie_search": "🔍 Поиск фильма",
    "list_films":   "📜 Фильмы по рейтингу",
    "select_films": "🎲 🎬 Случайный фильм из списка",
    "favorit_films":"🍿 Случайный фильм из избранного",
    "year":         "🎞️ Выберите год выпуска фильма\n\nОт этого зависит, какие фильмы я вам покажу",
    "genre":        "🎞️ Выберите жанр фильма\n\nЯ подберу лучшие фильмы выбранного жанра!",
    "rating":       "💯 Выберите рейтинг фильма\n\nОт этого зависит гамма эмоций и глубина сюжета. Что вам нужно?",
    "time":         "⏱️ Сколько времени готовы уделить фильму?",
    "review":       "Чтобы посмотреть трейлер фильма, укажите номер интересующего вас фильма из списка выше 👆",
    "like":         "Спасибо, что оценили, ❤️ Лайк добавлен! Всего: ",
    "again_likes":  "❌ Вы уже лайкали этот фильм, он в ваших избранных фильмах",
    "no_ratings":   "Я вас не понял\nПожалуйста воспользуйтесь кнопками выше 👆",
    "continue_ratings_list":    "Дальше уже некуда, у нас закончились фильмы 🤷‍♂️",
    "back_ratings_list":        "Ранее списка не было, тебе только двигаться дальше 👉",
    "no_number":                "Вы ввели номер, которого нет в этом списке 🤷‍♂️\nВведите пожалуйста правильный номер "
                                "из списка 📜\nНапример: 1, 2, 3 и т.д.",
    "random_film":              "🤨 Кажется, я не совсем понимаю, что вы имеете в виду.\n\nПопробуйте"
                                " воспользоваться кнопками выше 👆",
    "random_favorites_film":    "📭 Список избранных фильмов пуст.\n"
                                "👉 Чтобы пополнить его, вам нужно поставить лайк 👍 фильму.\n"
                                "✨ Тогда этот фильм, автоматически попадет в этот список!",
    "main":         "Я не знаю такую команду 🤔\n\nФункционал бота был обновлён, некоторые команды больше "
                    "не используются.\nПожалуйста выберите действие с помощью кнопок главного меню 👇",
    "dislike":      "🗑️ *Фильм удалён из избранного*\n\n📊 Ваша коллекция обновлена.\n🏠 Возврат в главное меню...\n\n"
                    "👇 Используйте кнопки ниже для дальнейших действий."
}