LEXICON: dict[str, str] = {
    "/start":       "<b>Привет</b>👋\n\nЯ телеграмм бот, который поможет тебе подобрать фильм для просмотра.\n"
                    "Можешь воспользоваться поиском фильма по критериям, или посмотреть уже то, что добавил "
                    "в избранное,\n"
                    "или открыть список и выбрать самостоятельно, Давайте начнем, нажми 👉 /go",
    "help":         "Используйте бота, чтобы найти фильм идеально подходящий под ваш запрос",
    "/go":          "Как будем искать фильм? Воспользуемся поиском по критериям? Или посмотрим избранное?🤷‍♂️\nВыберите "
                    "один из пунктов."
                    "Или попытаемся найти фильм самостоятельно?",
    "please":       "Я не понимаю, что вы хотите сказать. Давайте начнем с главного меню /start:",
    "no_years":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста, "
                    "выберите год выпуска фильма с помощью кнопок ниже 👇",
    "no_genre":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите жанр фильма с помощью кнопок ниже 👇",
    "no_rating":    "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите рейтинг фильма с помощью кнопок ниже 👇",
    "no_time":      "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите время просмотра фильма с помощью кнопок ниже 👇",
    "no_results":   "😔 По вашим критериям не найдено фильмов\n"
                    "Попробуйте:\n"
                    "• Расширить критерии поиска\n"
                    "• Использовать кнопку 'Пропуск' для некоторых параметров\n"
                    "• Начать новый поиск",
    "no_show":      "Я вас не понял\nПожалуйста выберите действие с помощью кнопок ниже 👇",
    "movie_search": "🔍 Поиск фильма",
    "list_films":   "📜 Фильмы по рейтингу",
    "select_films": "🎲 🎬 Случайный фильм из списка",
    "year":         "🎞️ Выберите год выпуска фильма\n\nОт этого зависит, какие фильмы я вам покажу",
    "genre":        "🎞️ Выберите жанр фильма\n\nЯ подберу лучшие фильмы выбранного жанра!",
    "rating":       "💯 Выберите рейтинг фильма\n\nОт этого зависит гамма эмоций и глубина сюжета. Что вам нужно?",
    "time":         "⏱️ Сколько времени готовы уделить фильму?",
    "review":       "Чтобы посмотреть трейлер фильма, укажите номер интересующего вас фильма из списка выше 👆",
    "like":         "Спасибо, что оценили, ❤️ Лайк добавлен! Всего:",
    "again_likes":  "❌ Вы уже лайкали этот фильм, он в ваших избранных фильмах",
    "no_ratings":   "Я вас не понял\nПожалуйста воспользуйтесь кнопками выше👆",
    "continue_ratings_list":    "Дальше уже некуда, у нас закончились фильмы 🤷‍♂️",
    "back_ratings_list":        "Ранее списка не было, тебе только двигаться дальше 👉",
    "no_number":                "Вы ввели номер, которого нет в этом списке 🤷‍♂️\nВведите пожалуйста правильный номер"
                                "из списка 📜"
}