LEXICON: dict[str, str] = {
    "/start":       "<b>Привет<b>👋\n\nЯ телеграмм бот, который поможет тебе подобрать фильм для просмотра.\n"
                    "Можешь воспользоваться поиском фильма по критериям, или посмотреть уже то, что добавил в избранное,\n"
                    "или открыть список и выбрать самостоятельно.\nЧтобы начать, отправьте сообщение 'go'.",
    "help":         "Используйте бота, чтобы найти фильм идеально подходящий под ваш запрос",
    "go":           "Как будем искать фильм? Воспользуемся поиском по критериям? Или посмотрим избранное?\n"
                    "Или попытаемся найти фильма самостоятельно?",
    "no":           "Извините, моя твоя не понимает",
    "movie_search": "🔍 Поиск фильма",
    "list_films":   "📜 Список фильмов",
    "select_films": "💼 Избранные фильмы",
    "year":         "🎞️ Выберите год выпуска фильма\n\nОт этого зависит, какие фильмы я вам покажу",
    "genre":        "🎞️ Выберите жанр фильма\n\nЯ подберу лучшие фильмы выбранного жанра!",
    "rating":       "💯 Выберите рейтинг фильма\n\nОт этого зависит гамма эмоций и глубина сюжета. Что вам нужно?",
    "time":         "⏱️ Сколько времени готовы уделить фильму?"
}