LEXICON: dict[str, str] = {
    "/start":       "<b>Привет</b>👋\n\nЯ телеграмм бот, который поможет тебе подобрать фильм для просмотра.\n"
                    "Можешь воспользоваться поиском фильма по критериям, или посмотреть уже то, что добавил "
                    "в избранное,\n"
                    "или открыть список и выбрать самостоятельно, Давайте начнем, нажми 👉 /go",
    "help":         "Используйте бота, чтобы найти фильм идеально подходящий под ваш запрос",
    "/go":          "Как будем искать фильм? Воспользуемся поиском по критериям? Или посмотрим избранное?🤷‍♂️\nВыберите "
                    "один из пунктов."
                    "Или попытаемся найти фильм самостоятельно?",
    "please":       "Я не понимаю, что вы хотите сказать. Давайте начнем с главного меню /start:",
    "no_years":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста, "
                    "выберите год выпуска фильма с помощью кнопок ниже 👇",
    "no_genre":     "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите жанр фильма с помощью кнопок ниже 👇",
    "no_rating":    "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите рейтинг фильма с помощью кнопок ниже 👇",
    "no_time":      "⚠️Вы ввели что-то другое, я вас не понял, советую пользоваться кнопками\n Пожалуйста"
                    "выберите время просмотра фильма с помощью кнопок ниже 👇",
    "no_results":   "😔 По вашим критериям не найдено фильмов\n"
                    "Попробуйте:\n"
                    "• Расширить критерии поиска\n"
                    "• Использовать кнопку 'Пропуск' для некоторых параметров\n"
                    "• Начать новый поиск",
    "movie_search": "🔍 Поиск фильма",
    "list_films":   "📜 Список фильмов",
    "select_films": "💼 Избранные фильмы",
    "year":         "🎞️ Выберите год выпуска фильма\n\nОт этого зависит, какие фильмы я вам покажу",
    "genre":        "🎞️ Выберите жанр фильма\n\nЯ подберу лучшие фильмы выбранного жанра!",
    "rating":       "💯 Выберите рейтинг фильма\n\nОт этого зависит гамма эмоций и глубина сюжета. Что вам нужно?",
    "time":         "⏱️ Сколько времени готовы уделить фильму?"
}